public class Task01 {
    public static void main(String[] args) {
        System.out.println("- Throwable: базовый класс для всех ошибок и исключений."); 
        // - Throwable: базовый класс для всех ошибок и исключений.

        System.out.println("- Error: индикаторы проблем, которые обычно не обрабатываются, такие как нехватка памяти."); 
        // - Error: индикаторы проблем, которые обычно не обрабатываются, такие как нехватка памяти.

        System.out.println("- Exception: класс для обозначения ошибок, которые могут быть обработаны, подлежат обработке, за исключением unchecked исключений.");
        // - Exception: класс для обозначения ошибок, которые могут быть обработаны, подлежат обработке, за исключением unchecked исключений.

        System.out.println("- RuntimeException: подкласс Exception для ошибок, которые могут возникнуть во время исполнения программы и которые можно было бы избежать с помощью предварительных проверок.");
        // - RuntimeException: подкласс Exception для ошибок, которые могут возникнуть во время исполнения программы и которые можно было бы избежать с помощью предварительных проверок.
    }
}